<?php

return 
[
    ///////////////////////////////////////////////////////////////////////////

    'global'        =>
    [
        'database'          =>
        [
            'server'                => '127.0.0.1',
            'port'                  => '5432',
            'db'                    => 'semena',
            'user'                  => 'semena',
            'passwd'                => 'CM5rJMt91zMRX8bvHyVH31gpqK6ymJEfKFXUmbmHOU3OXtO9PCBga8wSdM193Gee',
        ],

        'domains'           =>
            [
                #'www'           => 'semena.dev.artwebua.com.ua 195.248.225.53/',
                //'devstorage'       => 'http://storage.semena.dev.artwebua.com.ua/',
                'www'           => 'semena.in.ua',
                'www-dev'       => 'semena.dev.artwebua.com.ua',
                'storage'       => 'http://storage.semena.in.ua/',
                'devstorage'    => 'http://storage.'.str_replace('backend.', '', $_SERVER['SERVER_NAME']).'/' ,
            ],

        'title'                     => 'Професійне насіння',
        'keywords'                  => 'Професійне насіння keywords',
        'description'               => 'Професійне насіння description',


        'phones'                    => '(044)-581-67-15, (044)-451-48-59 <br /> (050)-464-48-59, (067)-464-48-59',
        'email'                     => 'ludmila.v@hs.kiev.ua, alla@hs.kiev.ua, lesya@hs.kiev.ua, olga@hs.kiev.ua,kristina@hs.kiev.ua',
        'name'                      => 'Semena',

        'delivery'      =>
            [
                '1' =>
                    [
                        '1old' => 'Я заберу товар в пункті видачі / самовивіз (м.Київ, вул.Віскозна 17/а)',
                        '2' => 'Доставка по м.Києву кур\'єром (вартість доставки 40 грн)',
                        '3old' => 'Достака по Україні службою "Нова Пошта" - самовивіз зі складу / вартість доставки від 20 грн (за тарифами поштової служби)',
                        '4' => 'Достака по Україні службою "Нова Пошта" - адресна доставка курє\'ром / вартість доставки від 20 грн (за тарифами поштової служби)',
                        '5' => 'Достака по Україні службою перевозки (Автолюкс, Укрпошта) / вартість доставки від 12 грн (за тарифами поштової служби)',
						'1' => "<b>Самовивіз з пункту видачі замовлень</b><br />",
						'111'=> "Час роботи пунктів видачі: з 9:00 до 18:00 (понеділок-п'ятниця). Попередньо дізнайтеся телефоном у менеджера про готовність Вашого замовлення.",
						'10001'=>'ст.м. Лісова, пр-т Броварський, Торговий павільон "Професійне насіння" №25;',
						'10002'=>'вул. Велика Кільцева 110-А, оптово-роздрібний ринок "Столичний", павільйон "Риба та м\'ясо";',
						'10003'=>'ст.м. Іподром, пр-т Академіка Глушкова, магазин "Професійне насіння" навпроти Південного автовокзалу;',
						'10004'=>'вул. Харьківське шосе 166-В, біля магазину "Сільпо";',
						'10005'=>'ст.м. Героїв Дніпра, пр-т Оболонський 43;',
						'7' => "<b>Адресна доставка кур’єром по м.Києву</b><br />",
						'77' =>	"Вартість доставки замовленнь складає 40 грн. У разі замовлення на суму більшу за 500 грн - доставка безкоштовна. Кур'єр попередньо узгодить з Вами час доставки телефоном.",
						'3' => "<b>Доставка службою &laquo;Нова Пошта&raquo;, самовивіз зі складу</b><br />",
						'33' => "Вартість доставки від 21 грн (за тарифами поштової служби). У разі замовлення на суму більшу за 500 грн - доставка до складу безкоштовна. Термін доставки – 1-2 дні.",
						'9' => "<b>Доставка службою &laquo;Нова Пошта&raquo;, адресна доставка кур&rsquo;єром</b><br />",
						"99" =>"Вартість доставки від 41 грн (за тарифами поштової служби). Термін доставки – 1-3 дні.",
						'10' => "<b>Доставка службою &laquo;Автолюкс&raquo;, самовивіз зі складу</b><br />",
						"1010" => "Вартість доставки від 17 грн (за тарифами поштової служби). У разі замовлення на суму більшу за 500 грн - доставка до складу безкоштовна. Термін доставки – 1-2 дні.",
						'11' => "<b>Доставка службою &laquo;Автолюкс&raquo;, адресна доставка кур&rsquo;єром</b><br />",
						"1111"=>"Вартість доставки від 37 грн (за тарифами поштової служби). Термін доставки – 1-3 дні.",
						'12' => "<b>Доставка &laquo;Укрпоштою&raquo;</b><br />",
						"1212"=>"Вартість доставки від 9 грн (в зв'язку з тим, що Укрпошта вимагає оплати доставки відправником, в разі передоплати рекомендуємо оплачувати вартість доставки разом з вартістю замовлення). У разі замовлення на суму більшу за 500 грн - доставка безкоштовна. Термін доставки – від 6 днів.
Увага! Укрпоштою забороняється доставка вантажів що містять рідину (пляшки, відра та інші ємності).",
					],
                '2' =>
                    [
                        '1old' => 'Я заберу товар в пункте выдачи / самовывоз (г.Киев, ул.Вискозная 17 / а)',
                        '2' => 'Доставка по Киеву кур \' премьером (стоимость доставки 40 грн) ',
                        '3old' => 'Достака по Украине службой "Новая Почта" - самовывоз со склада / стоимость доставки от 20 грн (по тарифам почтовой службы)',
                        '4' => 'Достака по Украине службой "Новая Почта" - адресная доставка Куреи \' ром / стоимость доставки от 20 грн (по тарифам почтовой службы)',
                        '5' => 'Достака по Украине службой перевозки (Автолюкс, Укрпочта) / стоимость доставки от 12 грн (по тарифам почтовой службы)',
                        '1' => "<b>Самовывоз с пункта выдачи заказов</b> <br />",
                        '111'=> "Время работы пунктов выдачи: с 9:00 до 18:00 (понедельник - пятница). Предварительно узнайте у менеджера о готовности Вашего заказа.",
						'10001'=>'ст.м. Лесная, пр-т Броварской, Торговий павильйон "Професійне насіння" №25;',
						'10002'=>'ул. Большая Окружная 110-А, оптово-розничный рынок "Столичный", павильон "Рыба и мясо";',
						'10003'=>'ст.м. Іподром, пр-т Академика Глушкова №6, магазин "Професійне насіння" напротив Южного автовокзала;',
						'10004'=>'ул. Харьковское шоссе 166-В, магазин "Професійне насіння" возле магазина "Сільпо";',
						'10005'=>'ст.м. Героев Днепра, пр-т Оболонський 43, магазин "Професійне насіння";',
                        '7' => '<b>Адресная доставка курьером по г.Киеву</b> <br />',
                        "77" =>"Стоимость доставки заказа составляет 40 грн. В случае заказа на сумму большую 500 грн - доставка бесплатная. Курьер предварительно согласует с Вами время доставки по телефону.",
                        '3' => "<b>Доставка службой&nbsp;&laquo;Новая Почта&raquo;, самовывоз&nbsp;со&nbsp;склада</b> <br />",
                        "33" => "Стоимость доставки от 21 грн (по тарифам почтовой службы). В случае заказа на сумму большую 500 грн - доставка до склада безплатная. Срок доставки – 1-2 дня.",
                        "9" => "<b>Доставка службой&nbsp;&laquo;Новая Почта&raquo;, адресная доставка курьером</b> <br />",
                        "99" => "Стоимость доставки от 41 грн (по тарифам почтовой службы). Срок доставки – 1-3 дня.",
                        '10' =>'<b>Доставка службой&nbsp;&laquo;Автолюкс&raquo;, самовывоз&nbsp;со&nbsp;склада</b> <br />',
                        "1010" =>"Стоимость доставки от 17 грн (по тарифам почтовой службы). В случае заказа на сумму большую 500 грн - доставка до склада безплатная. Срок доставки – 1-2 дня.",
                        '11' =>'<b>Доставка службой&nbsp;&laquo;Автолюкс&raquo;, адресная доставка курьером</b> <br />',
                        "1111"=> 'Стоимость доставки от 37 грн (по тарифам почтовой службы). Срок доставки – 1-3 дня.',
                        '12' => '<b>Доставка &laquo;Укрпочтой&raquo;</b> <br />',
                        '1212'=>'Стоимость доставки от 9 грн (в связи с тем, что Укрпочта требует оплаты доставки отправителем, в случае предоплаты рекомендуем оплачивать стоимость доставки вместе со стоимостью заказа). В случае заказа на сумму большую 500 грн - доставка безплатная. Срок доставки – от 6 дней.
Внимание! Укрпочтой запрещена доставка грузов, которые содержат жидкости (бутылки, ведра и другие емкости).'

                    ],
            ],

        'pay'      =>
            /*[
                '1' => 'Оплата готівкою при отриманні товару (в разі доставки службою перевозки додатково утримується комісія за наложений платіж 4%);',
                '2' => 'Оплата карткою VISA, MASTERCARD/EVROCARD;',
                '3' => 'Оплата за безготівковим розрахунком (рахунок на оплату відправимо відразу після обробки замовлення на Ваш e-mail);',
                '4' => 'Оплата через термінал I-box;',
            ],*/
    [
        '1' =>
                [
                    '1' => '<b>Оплата при отриманні товару</b><br />',
                    '11' => 'У разі самовивозу або доставки замовлення кур’єром по м.Києву ви зможете оплатити замовлення готівкою або платіжною карткою через  POS-термінал. Ніяких додаткових комісій при цьому ви не платите.
                        <br>В разі доставки замовлення службами перевезення ви зможете оплатити замовлення готівкою, при цьому поштові служби додатково візьмуть комісію за наложений платіж, яка у «Нової пошти» складає 20 грн + 2% від суми замовлення, «Автолюкса» -15 грн + 2% від суми замовлення, «Укрпошти» - 6,50 грн + 1%.',
                    '2' => '<b>Online оплата в LiqPay  карткою Visa,  Masterkard/Evrocard</b><br />',
                    '22' =>'Безпосередньо при оформленні замовлення на нашому сайті доступна оплата платіжною карткою Visa, Mastercard/Evrocard будь якого банку. Вам буде надано безпечний канал та спеціальна форма, де ви абсолютно безкоштовно здійсните оплату. Зверніть увагу, що при оплаті онлайн на вашій картці банком має бути встановлений достатній ліміт на проведення платежів в мережі інтернет. ',
                    '3' => '<b>Оплата через термінал Приватбанк</b><br />',
                    '33' => 'Оплата замовлення готівкою або з платіжної карти через термінал Приватбанку. Комісія за здійснення платежу - всього 1-3 грн (згідно тарифів банку).',
                    '4' => '<b>Оплата за безготівковим розрахунком</b><br />',
                    '44' =>'На електронну адресу, яку ви вказали при оформленні замовлення, для Вашого підприємства надійде рахунок-фактура для оплати (з ПДВ). Ми є платником податку на прибуток на загальних підставах. Після отримання оплати Ваше замовлення негайно буде передано на відправку. Також, для прискорення оформлення документів, просимо відправити на нашу електронну адресу копії св-ва про реєстрацію та  платника ПДВ.',
                ],
        '2' =>
            [

                '1' => '<b> Оплата при получении товара </b> <br />',
                '11' =>'В случае самовывоза или доставки заказа курьером по г.Киеву, вы сможете оплатить заказ наличными или платёжной картой через мобильный POS-терминал. Никаких дополнительных комиссий при этом вы не оплачиваете.
                        <br>В случае доставки заказа службами перевозок, вы сможете оплатить заказ наличными, при этом почтовые службы дополнительно возьмут комиссию за наложеный платёж, которая у "Новой Почты" составит 20 грн + 2% от суммы заказа, у "Автолюкса" - 15 грн + 2% от суммы заказа, у "Укрпочты" - 6,50 грн + 1%.',
                '2' => '<b> Online оплата в LiqPay карточкой Visa, Masterkard / Evrocard </b> <br />',
                '22'=> 'Непосредственно при оформлении заказа на нашем сайте доступна оплата платежной картой Visa, Mastercard / Evrocard любого банка. Вам будет предоставлен безопасный канал и специальная форма, где вы абсолютно бесплатно осуществите оплату. Обратите внимание, что при оплате онлайн на вашей карточке банком должен быть установлен достаточный лимит на проведение платежей в сети интернет. ',
                '3' => '<b> Оплата через терминал Приватбанк </b> <br />',
                '33' =>'Оплата заказа наличными или с платёжной карты через терминал Приватбанка. Комиссия за осуществление платежа - всего 1-3 грн (согласно тарифам банка).',
                '4' => '<b> Оплата по безналичному расчету </b> <br />',
                '44' =>'На электронный адрес, который вы указали при оформлении заказа, для Вашего предприятия поступит счет-фактура для оплаты (с НДС). Мы является плательщиком налога на прибыль на общих основаниях. После получения оплаты Ваш заказ немедленно будет передан на отправку. Также, для ускорения оформления документов, просим отправить на наш электронный адрес копии св-ва о регистрации и плательщика НДС. ',
            ],
    ],

        'status'      =>
            [
                '1' =>
                    [
                        '1' => ['Новий', 'order_new'],
                        '2' => ['Обробленний', 'order_ok'],
                        '3' => ['Виконанний', 'order_made'],
                        '4' => ['Відкладенний', 'order_pause'],
                        '5' => ['Відміненний', 'order_cancel'],
                        '6' => ['Повернення', 'order_return'],
                    ],
                '2' =>
                    [
                        '1' => ['Новый', 'order_new'],
                        '2' => ['Обработанный', 'order_ok'],
                        '3' => ['Выполнен', 'order_made'],
                        '4' => ['Отложен', 'order_pause'],
                        '5' => ['Отменен', 'order_cancel'],
                        '6' => ['Возврат', 'order_return'],
                    ]
            ],

        'status_pay'      =>
            [
                '1' =>
                    [
                        '1' => 'Сплачено',
                        '2' => 'Не сплачено',
                    ]

            ],

        'storage'           =>
            [
                'dealers'              =>
                    [
                        '160x'    =>
                            [
                                'width'         => 160,
                                'height'        => 160
                            ]
                    ],
                'avatar'               =>
                    [
                        '128x'    =>
                            [
                                'width'         => 128,
                                'height'        => 128,
                            ],
                        '200x'    =>
                            [
                                'width'         => 200,
                                'height'        => 200,
                            ],
                        '400x'    =>
                            [
                                'width'         => 400,
                                'height'        => 400,
                            ],
                        '800x'   =>
                            [
                                'width'         => 800,
                                'height'        => 800,
                            ]
                    ],
                'group'               =>
                    [
                        '128x128'    =>
                            [
                                'width'         => 128,
                                'height'        => 128,
                            ],
                        '400x400'    =>
                            [
                                'width'         => 400,
                                'height'        => 400,
                            ],
                        '800x'   =>
                            [
                                'width'         => 800,
                                'height'        => 800,
                            ]
                    ],

                'subtype'               =>
                    [
                        '165x120'    =>
                            [
                                'width'         => 165,
                                'height'        => 120,
                            ]
                    ],

                'news'               =>
                    [
                        '400x265'    =>
                            [
                                'width'         => 400,
                                'height'        => 265,
                            ],
                        '180x120'    =>
                            [
                                'width'         => 180,
                                'height'        => 120,
                            ],
                        '135x100'    =>
                            [
                                'width'         => 135,
                                'height'        => 100,
                            ],
                        '800x'   =>
                            [
                                'width'         => 800,
                                'height'        => 800,
                            ]
                    ],
                'order_blank'        => 'blank.xls',
            ],
    ],



    ///////////////////////////////////////////////////////////////////////////

    'frontend'                           =>
    [
        'dirs'              =>
        [
            'controllersDir'            => 'app/frontend/controllers/',
            'appLibrariesDir'           => 'app/frontend/lib/',
            'librariesDir'              => 'lib/',
            'modelsDir'                 => 'lib/models/',
            'viewsDir'                  => 'app/frontend/views/',
            'messagesDir'               => 'app/frontend/messages/',
        ],

        'defaults'          =>
        [
            'default_route'             => 'homepage',
            'default_users_group'       => 'options',
            'default_special_users_id'  => 3,
            'default_user_image'        => '/dist/img/icon_user_85.png'
        ],

        'limits'            =>
        [
            'search'                    => 20,
            'top_items'                 => 5,
            'items'                     => 12,
            'news'                      => 10,
            'groups2news'               => 5,
            'items_dropdown'            => 4,
            'dealer_catalog'            => 50
        ],

        'lifetime'          =>
        [

            'models\settings'             =>
            [
                'getSettingsChatInviteMessages' => 5
            ],
        ],
        'top_items' =>
        [
            'from' => date('Y-m-d', strtotime('now')-1296000),
            'from_three_month' => date('Y-m-d', strtotime('now')-1296000 * 3),
            'to'   => date("Y-m-d"),
        ],

        'equipment' =>
        [
            507, 508
        ],
        'dealer_rubric' => [ 9 ],
        'stock_availability' => ['not_available', 'few', 'enough', 'many']
    ],

    ///////////////////////////////////////////////////////////////////////////

    'backend'                           =>
    [
        'dirs'              =>
        [
            'controllersDir'            => 'app/backend/controllers/',
            'appLibrariesDir'           => 'app/backend/lib/',
            'librariesDir'              => 'lib/',
            'modelsDir'                 => 'lib/models/',
            'viewsDir'                  => 'app/backend/views/',
            'messagesDir'               => 'app/backend/messages/',
        ],

        'limits'            =>
            [
                'admin_orders'                => 10,
            ],

        'admin_delivery'      =>
            [
                '1' => 'Самовывоз',
                '2' => 'Курьером',
                '3' => 'Новая почта (самовывоз)',
                '4' => 'Новая почта (курьером)',
                '5' => 'Служба перевозки',
            ],


    ],
    ///////////////////////////////////////////////////////////////////////////

    'cabinet'                           =>
        [
            'dirs'              =>
                [
                    'controllersDir'            => 'app/cabinet/controllers/',
                    'appLibrariesDir'           => 'app/cabinet/lib/',
                    'librariesDir'              => 'lib/',
                    'modelsDir'                 => 'lib/models/',
                    'viewsDir'                  => 'app/cabinet/views/',
                    'messagesDir'               => 'app/cabinet/messages/',
                ],

            'limits'            =>
                [
                    'admin_orders'                => 10,
                ],

            'admin_delivery'      =>
                [
                    '1' => 'Самовывоз',
                    '2' => 'Курьером',
                    '3' => 'Новая почта (самовывоз)',
                    '4' => 'Новая почта (курьером)',
                    '5' => 'Служба перевозки',
                ],


        ],
    ///////////////////////////////////////////////////////////////////////////

    'tasks'                             =>
    [
        'dirs'                          =>
        [
            'controllersDir'            => 'app/tasks/',
            'librariesDir'              => 'lib/',
            'modelsDir'                 => 'lib/models/',
        ],
    ],

    ///////////////////////////////////////////////////////////////////////////
];
